app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "destinc"], ["LIMIT", 1]]
---
def login
  @user = User.find_by_username(params[:username])