app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC
---
      def index
        @ideas = Idea.order("created_at DESC")

INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2019-09-13 18:31:57.073643"], ["updated_at", "2019-09-13 18:31:57.073643"]]
---
    def create
      @idea = Idea.create(idea_params)

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "ideas" SET "body" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["body", "lkafsdfasdhfasdlkf"], ["updated_at", "2019-09-13 18:32:10.215813"], ["id", 14]]
---
    def update
      @idea = Idea.find(params[:id])
      @idea.update_attributes(idea_params)

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 15]]
---
    def destroy
      @idea = Idea.find(params[:id])
      if @idea.destroy